INSERT INTO public.types (id, name) VALUES
(1, 'Учебная лицензия на 50 компьютеров'),
(2, 'OpenSource'),
(3, 'Бесплатно для некоммерческого использования'),
(4, 'Community - бесплатная лицензия'),
(5, 'Бесплатная лицензия');

INSERT INTO public.licenses (id, namePo, idType, startDate, endDate, countStart, countNow) VALUES
(1, '1C: Предприятие', 1, '2023-10-21', '2025-06-03', 50, 2),
(2, 'Gretl', 2, '2023-11-10', '2024-11-19', 30, 8),
(3, 'VirtualBox', 3, '2023-09-27', '2024-06-27', 35, 12),
(4, 'Wine ', 2, '2024-01-01', '2024-08-17', 35, 31),
(5, 'LibreCAD', 2, '2023-12-16', '2025-03-05', 35, 7),
(6, 'Arduino IDE', 2, '2023-10-31', '2024-11-02', 50, 16),
(7, 'Dbeaver', 4, '2023-08-02', '2025-04-02', 35, 9),
(8, 'Eclipse IDE', 2, '2023-12-10', '2025-01-30', 35, 0),
(9, 'PyCharm', 4, '2023-08-22', '2025-04-06', 35, 0),
(10, 'VSCodium', 2, '2023-07-13', '2025-03-03', 35, 3),
(11, 'Scilab', 2, '2023-01-24', '2024-07-21', 35, 2),
(12, 'Visual Studio Code', 2, '2023-10-28', '2024-08-07', 35, 6),
(13, 'Android Studio', 2, '2023-05-06', '2025-04-26', 35, 5),
(14, 'WxMaxima', 2, '2023-11-17', '2024-10-05', 35, 29),
(15, 'Anaconda Free', 5, '2023-04-15', '2025-02-14', 35, 15),
(16, 'Libre Office', 2, '2023-11-18', '2025-04-05', 35, 0),
(17, 'Bzip2', 2, '2023-10-15', '2024-10-27', 35, 22),
(18, 'Loginom', 4, '2023-06-22', '2025-07-01', 35, 7),
(19, 'Операционная система Ред ОС 7.3', 5, '2023-01-20', '2024-09-27', 35, 0);