INSERT INTO public.types (id, name) VALUES
(1, 'Учебная лицензия на 50 компьютеров'),
(2, 'OpenSource'),
(3, 'Бесплатно для некоммерческого использования'),
(4, 'Community - бесплатная лицензия'),
(5, 'Бесплатная лицензия');

INSERT INTO public.licenses (id, namePo, idType, startDate, endDate, countStart, countNow) VALUES
(1, '1C: Предприятие', 1, '2023-09-01', '2024-08-31', 50, 2),
(2, 'Gretl', 2, '2023-09-01', '2024-08-31', 30, 8),
(3, 'VirtualBox', 3, '2023-09-01', '2024-08-31', 35, 12),
(4, 'Wine ', 2, '2023-09-01', '2024-08-31', 35, 31),
(5, 'LibreCAD', 2, '2023-09-01', '2024-08-31', 35, 7),
(6, 'Arduino IDE', 2, '2023-09-01', '2024-08-31', 50, 16),
(7, 'Dbeaver', 4, '2023-09-01', '2024-08-31', 35, 9),
(8, 'Eclipse IDE', 2, '2023-09-01', '2024-08-31', 35, 0),
(9, 'PyCharm', 4, '2023-09-01', '2024-08-31', 35, 0),
(10, 'VSCodium', 2, '2023-09-01', '2024-08-31', 35, 3),
(11, 'Scilab', 2, '2023-09-01', '2024-08-31', 35, 2),
(12, 'Visual Studio Code', 2, '2023-09-01', '2024-08-31', 35, 6),
(13, 'Android Studio', 2, '2023-09-01', '2024-08-31', 35, 5),
(14, 'WxMaxima', 2, '2023-09-01', '2024-08-31', 35, 29),
(15, 'Anaconda Free', 5, '2023-09-01', '2024-08-31', 35, 15),
(16, 'Libre Office', 2, '2023-09-01', '2024-08-31', 35, 0),
(17, 'Bzip2', 2, '2023-09-01', '2024-08-31', 35, 22),
(18, 'Loginom', 4, '2023-09-01', '2024-08-31', 35, 7),
(19, 'Операционная система Ред ОС 7.3', 5, '2023-09-01', '2024-08-31', 35, 0);